> help
OK
SessionWithLoop instance specific commands:
repeat	repeat the following commands, until done, for argument times
done	close of a loop.

command executor commands:
echo	echo arguments.
sleep	sleep for specified time (seconds in double).
assert	assert the value of the last result. 1st argument the return code string, 2nd argument(optional) is is the result string.
help, ?	print help.
continueOnError, coe	set whether to continue on command execution error. if no argument is given, prints out current state, otherwise use argument on or off.
exit	exit current session with an optional argument.
end	exit current session and all parent sessions with an optional argument.
localEcho	With an argument, set local echo to on or off, or without argument, show current local echo state.
source, .	parameter: script_filename	execute the script file in a new session.
system, sys	execute a system command with args
> ?
OK
SessionWithLoop instance specific commands:
repeat	repeat the following commands, until done, for argument times
done	close of a loop.

command executor commands:
echo	echo arguments.
sleep	sleep for specified time (seconds in double).
assert	assert the value of the last result. 1st argument the return code string, 2nd argument(optional) is is the result string.
help, ?	print help.
continueOnError, coe	set whether to continue on command execution error. if no argument is given, prints out current state, otherwise use argument on or off.
exit	exit current session with an optional argument.
end	exit current session and all parent sessions with an optional argument.
localEcho	With an argument, set local echo to on or off, or without argument, show current local echo state.
source, .	parameter: script_filename	execute the script file in a new session.
system, sys	execute a system command with args
> badCmd
INVALID_COMMAND
> echo abc
def and \n
OK
abc
def and \n
> . build/resources/test/cliTestSubscript.txt
> echo from a sub-script
OK
from a sub-script
> echo 123
OK
123
> assert OK 123
OK
> assert OK
OK
> sleep 3.3
OK
> exit
EXIT
