> help
OK
help, ?	print help.
end	exit current session and all parent sessions with an optional argument.
localEcho	With an argument, set local echo to on or off, or without argument, show current local echo state.
exit	exit current session with an optional argument.
source, .	parameter: script_filename	execute the script file in a new session.
continueOnError, coe	set whether to continue on command execution error. if no argument is given, prints out current state, otherwise use argument on or off.
repeat	repeat the following commands, until done, for argument times
done	close of a loop.
from command executor: 
sleep	sleep for specified time (seconds in double).
help, ?	print help.
source, .	parameter: script_filename	execute the script file in a new session.
echo	echo arguments.
assert	assert the value of the last result. 1st argument the return code string, 2nd argument(optional) is is the result string.
> ?
OK
help, ?	print help.
end	exit current session and all parent sessions with an optional argument.
localEcho	With an argument, set local echo to on or off, or without argument, show current local echo state.
exit	exit current session with an optional argument.
source, .	parameter: script_filename	execute the script file in a new session.
continueOnError, coe	set whether to continue on command execution error. if no argument is given, prints out current state, otherwise use argument on or off.
repeat	repeat the following commands, until done, for argument times
done	close of a loop.
from command executor: 
sleep	sleep for specified time (seconds in double).
help, ?	print help.
source, .	parameter: script_filename	execute the script file in a new session.
echo	echo arguments.
assert	assert the value of the last result. 1st argument the return code string, 2nd argument(optional) is is the result string.
> badCmd
INVALID_COMMAND
> echo abc
def and \n
OK
abc
def and \n
> . build/resources/test/cliTestSubscript.txt
> echo from a sub-script
OK
from a sub-script
> echo 123
OK
123
> assert OK 123
OK
> assert OK
OK
> sleep 3.3
OK
> exit
EXIT
